jmeter/pdf-local-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Local PDF Rendering Load Test">
      <stringProp name="TestPlan.comments">JMeter fetches job JSON from Streem API, then POSTs it to the local Playwright PDF renderer</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="api_base" elementType="Argument">
            <stringProp name="Argument.name">api_base</stringProp>
            <stringProp name="Argument.value">https://api.qa.platform.leucinetech.com/v1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token" elementType="Argument">
            <stringProp name="Argument.name">token</stringProp>
            <stringProp name="Argument.value">Bearer eyJhbGciOiJIUzUxMiJ9.eyJsYXN0TmFtZSI6IlMiLCJvcmdhbmlzYXRpb25JZCI6MTYxNzYyNTQwMSwicm9sZXMiOlt7ImlkIjoiMSIsIm5hbWUiOiJBQ0NPVU5UX09XTkVSIn1dLCJlbXBsb3llZUlkIjoibXJpZHVsLjA1IiwiaGFzU2V0Q2hhbGxlbmdlUXVlc3Rpb24iOnRydWUsImZpcnN0TmFtZSI6Ik1yaWR1bCIsImlkIjo3MTc5NzU4OTg2ODYwNzg5NzYsImZhY2lsaXR5SWRzIjpbLTEsMTY0MzEwMzUwMywxNjQzMTAzNTAyLDE2NDMxMDM1MDEsMTYxNjM2NzgwMywxNjE2MzY3ODAyLDE2MTYzNjc4MDFdLCJzZXJ2aWNlSWQiOiJjNmQ4Mjg1YjcyYTg0ZWZiOGZiZDYwOGM3Y2FkYTQ4NCIsImZhY2lsaXRpZXMiOlt7ImlkIjoiLTEiLCJuYW1lIjoiR2xvYmFsIFBvcnRhbCJ9LHsiaWQiOiIxNjE2MzY3ODAxIiwibmFtZSI6IkJhbmdhbG9yZSJ9LHsiaWQiOiIxNjE2MzY3ODAzIiwibmFtZSI6IkRlbGhpIn0seyJpZCI6IjE2NDMxMDM1MDIiLCJuYW1lIjoiTG9uZG9uIn0seyJpZCI6IjE2MTYzNjc4MDIiLCJuYW1lIjoiTXVtYmFpIn0seyJpZCI6IjE2NDMxMDM1MDEiLCJuYW1lIjoiTmV3IFlvcmsifSx7ImlkIjoiMTY0MzEwMzUwMyIsIm5hbWUiOiJTeWRuZXkifV0sImN1cnJlbnRGYWNpbGl0eUlkIjoxNjE2MzY3ODAzLCJyb2xlTmFtZXMiOlsiQUNDT1VOVF9PV05FUiJdLCJlbWFpbCI6ImFvLjM5QG1haWxpbmF0b3IuY29tIiwianRpIjoiNjJmMjU3MTJlMDNiNDU2OTgwMDI2ZDAzNmFkZjZkZDEiLCJ1c2VybmFtZSI6Im1yaWR1bC4wMSIsInN1YiI6Im1yaWR1bC4wMSIsImlhdCI6MTc3MTE3MTgwNCwiZXhwIjoxNzcxMjc5ODA0fQ.14bg4DtRYgNzTP_tvZPXcfsHd8zyDphJaX_SPfE3UhHY-CqgApksQy9ZkjrGlosBQQXTBxNF-ofq4d0_lJK9Qg</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="facility_id" elementType="Argument">
            <stringProp name="Argument.name">facility_id</stringProp>
            <stringProp name="Argument.value">1616367803</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="job_ids" elementType="Argument">
            <stringProp name="Argument.name">job_ids</stringProp>
            <stringProp name="Argument.value">722492974613180416</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="PDF Render Threads">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Pick Job ID" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">def ids = vars.get("job_ids").split(",")
def idx = ctx.getThreadNum() % ids.length
vars.put("jobId", ids[idx].trim())</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Fetch Job Data" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">30000</intProp>
          <stringProp name="HTTPSampler.domain">api.qa.platform.leucinetech.com</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v1/jobs/${jobId}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="API Headers" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${token}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">facilityId</stringProp>
                <stringProp name="Header.value">${facility_id}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert API 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200 from Streem API</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Job Response" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">jobResponse</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">{}</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Render PDF" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">120000</intProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/pdf</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${jobResponse}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="PDF Server Headers" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${token}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">facilityId</stringProp>
                <stringProp name="Header.value">${facility_id}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Content-Type PDF" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1248334925">application/pdf</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected Content-Type: application/pdf</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Save PDF to File" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
import java.nio.file.*

def outputDir = new File(&quot;jmeter/pdf-output&quot;)
if (!outputDir.exists()) outputDir.mkdirs()

def threadNum = ctx.getThreadNum()
def jobId = vars.get(&quot;jobId&quot;) ?: &quot;unknown&quot;
def fileName = &quot;job-${jobId}-thread${threadNum}.pdf&quot;
def outFile = new File(outputDir, fileName)

// Save PDF bytes
def responseBytes = prev.getResponseData()
Files.write(outFile.toPath(), responseBytes)

def absPath = outFile.getAbsolutePath()
def fileUri = &quot;file:///&quot; + absPath.replace(&quot;\\\\&quot;, &quot;/&quot;)

// Replace response data with clickable link
prev.setResponseData(&quot;PDF saved to: ${absPath}\n\nOpen: ${fileUri}\n\nSize: ${responseBytes.length} bytes&quot;, &quot;UTF-8&quot;)
prev.setDataType(&quot;text&quot;)
</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>